# 2016-04-27 Zhanzhao Liang
INSERT INTO `dict_regionalism` VALUES
   ('442027', '中山市', '442000', '中山', '3', '0760', '528400', '中国,广东省,中山市,中山市', '113.378835', '22.52522', 'Zhongshan', '1', null, null);

# 2016-04-28 Kaiming Zeng
INSERT INTO `buss_order_src` (`id`,`parent_id`,`parent_ids`,`level`,`name`,`sort`,`created_by`,`created_time`,`updated_by`,`updated_time`,`del_flag`,`merge_name`,`remark`)
VALUES (57,0,'0,57',1,'东方福利网',0,1,'2016-04-28 11:26:31',NULL,NULL,1,'东方福利网',NULL);
INSERT INTO `buss_order_src` (`id`,`parent_id`,`parent_ids`,`level`,`name`,`sort`,`created_by`,`created_time`,`updated_by`,`updated_time`,`del_flag`,`merge_name`,`remark`)
VALUES (58,48,'48,58',2,'淘宝',0,1,'2016-04-28 11:26:55',NULL,NULL,1,'电商平台,淘宝',NULL);

# 2016-04-30 Zhanzhao Liang
INSERT INTO `dict_regionalism` VALUES
  ('130103', '桥东区', '130100', '桥东', '3', '0311', '050091', '中国,河北省,石家庄市,桥东区', '114.46977', '38.03221', 'Qiaodong', '1', null, null),
  ('320601', '开发区', '320600', '开发', '3', '0513', '226001', '中国,江苏省,南通市,开发区', '120.8573', '32.0098', 'Kaifa', '1', null, null);

# 2016-05-05 Zhenglin Zhu
# 全文检索加入<验券券号>\<下单人手机号后5位>\<收货人手机号后5位>
ALTER TABLE `tiramisu`.`buss_order_fulltext` ADD COLUMN `coupon` varchar(50) NOT NULL DEFAULT 'NONE' COMMENT '验券的券号' AFTER `deliveryman_mobile`,
ADD COLUMN `recipient_mobile_suffix` varchar(5) NOT NULL DEFAULT '00000' COMMENT '收货人手机号后5位' AFTER `coupon`,
ADD COLUMN `owner_mobile_suffix` varchar(5) NOT NULL DEFAULT '00000' COMMENT '下单人手机号后5位' AFTER `recipient_mobile_suffix`,
DROP INDEX `IDX_FL`,
ADD FULLTEXT `IDX_FL` (`owner_name`, `owner_mobile`, `recipient_name`, `recipient_mobile`, `recipient_address`, `landmark`, `show_order_id`, `merchant_id`, `coupon`, `recipient_mobile_suffix`, `owner_mobile_suffix`) comment '';

# 审核重新打印列表建立索引
ALTER TABLE `tiramisu`.`buss_print_apply` ADD INDEX `IDX_SHOW_ORDER_ID` (`show_order_id`) comment '在页面上展示的订单号建立索引，便于查询';

# 2016-05-09 Wei Zhao
# 订单配送记录表
DROP TABLE IF EXISTS `buss_delivery_record`;
CREATE TABLE `buss_delivery_record` (
    `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录编号',
    `order_id` int(11) NOT NULL COMMENT '订单id',
    `deliveryman_id` int(11) NOT NULL COMMENT '配送员id',
    `delivery_pay` int(11) NOT NULL COMMENT '配送工资',
    `delivery_count` int(11) NOT NULL DEFAULT '1' COMMENT '配送次数',
    `is_review` tinyint(1) DEFAULT '0' COMMENT '审核标志（0：未审核；1：已审核）',
    `updated_by` int(11) NOT NULL COMMENT '记录更新操作者id',
    `updated_time` datetime DEFAULT NULL COMMENT '记录更新时间',
    `remark` varchar(255) DEFAULT NULL COMMENT '备注',
    PRIMARY KEY (`id`),
    UNIQUE KEY `IDX_ORDER_ID` (`order_id`),
    KEY `IDX_DM_ID` (`deliveryman_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='订单配送记录表';

# 2016-05-09 Wei Zhao
# 配送成功图片凭证
DROP TABLE IF EXISTS `buss_delivery_picture`;
CREATE TABLE `buss_delivery_picture` (
    `order_id` int(11) NOT NULL COMMENT '订单id',
    `deliveryman_id` int(11) NOT NULL COMMENT '配送员id',
    `delivery_count` int(11) NOT NULL DEFAULT '1' COMMENT '第几次配送',
    `picture_type` enum  ('RECEIPT','DOOR','CALL','SMS') NOT NULL COMMENT '单据，门牌，通话记录，短信记录',
    `picture_url` varchar(255) NOT NULL COMMENT '图片url',
    UNIQUE KEY `IDX_UNIQUE` (`order_id`,`delivery_count`,`picture_type`),
    KEY `IDX_ORDER_ID` (`order_id`),
    KEY `IDX_DM_ID` (`deliveryman_id`),
    KEY `IDX_DC` (`delivery_count`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='配送成功图片凭证';
INSERT INTO `buss_delivery_picture` VALUES
    (10000001, 1, 1, 'RECEIPT', 'http://picture.xfxb.net/receipt_1.jpg'),
    (10000001, 1, 1, 'DOOR', 'http://picture.xfxb.net/door_1.jpg'),
    (10000001, 1, 1, 'CALL', 'http://picture.xfxb.net/call_1.jpg'),
    (10000001, 1, NULL, 'SMS', 'http://picture.xfxb.net/sms_1.jpg');

# 2016-05-10 Wei Zhao
# 增加pos相关字段
ALTER TABLE `tiramisu`.`buss_order` ADD COLUMN `is_pos_pay` tinyint(1) DEFAULT NULL COMMENT 'pos支付标志';

# 2016-05-17 Wei Zhao
# 创建产品配送工资计算规则对应表
DROP TABLE IF EXISTS `delivery_pay_rule`;
CREATE TABLE `delivery_pay_rule` (
    `category_id` int(11) NOT NULL COMMENT '产品类型',
    `rule_type` enum  ('CAKE','COOKIE','WINE','SOUVENIR') NOT NULL COMMENT '蛋糕，下午茶/曲奇，红酒，手信',
    `del_flag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '软删除标志',
    PRIMARY KEY (`category_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='创建产品配送工资计算规则对应表';
INSERT INTO `delivery_pay_rule` VALUES
    (1, 'CAKE', 1),
    (3, 'SOUVENIR', 1),
    (4, 'COOKIE', 1),
    (5, 'COOKIE', 1),
    (6, 'SOUVENIR', 1),
    (7, 'SOUVENIR', 1),
    (8, 'SOUVENIR', 1),
    (10, 'CAKE', 1),
    (11, 'CAKE', 1),
    (12, 'CAKE', 1),
    (13, 'CAKE', 1),
    (14, 'CAKE', 1);

DROP TABLE IF EXISTS `buss_product_category_regionalism`;
CREATE TABLE `buss_product_category_regionalism` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `category_id` int(10) unsigned NOT NULL COMMENT '分类id',
  `regionalism_id` int(10) unsigned NOT NULL COMMENT '区域id',
  `sort` int(10) unsigned NOT NULL DEFAULT '4294967295' COMMENT '排序权重',
  `channel` enum('PC') DEFAULT 'PC' COMMENT 'PC端',
  `created_by` int(10) unsigned NOT NULL COMMENT '创建人',
  `created_time` datetime NOT NULL COMMENT '创建时间',
  `updated_by` int(10) unsigned DEFAULT NULL COMMENT '更新者',
  `updated_time` datetime DEFAULT NULL COMMENT '更新时间',
  `del_flag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '删除标志',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=594 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='分类-区域';

ALTER TABLE `tiramisu`.`buss_product_category` DROP COLUMN `sort`;
ALTER TABLE `tiramisu`.`buss_product_category`
ADD COLUMN `remarks` varchar(255) DEFAULT NULL COMMENT '备注信息' AFTER `name`;
ALTER TABLE `tiramisu`.`buss_product_category`
ADD COLUMN `isAddition` TINYINT(1) NOT NULL DEFAULT '0' COMMENT '是否为附加商品，1表示是，0表示否' AFTER `remarks`;

ALTER TABLE `tiramisu`.`buss_product` 
DROP COLUMN `original_price`,
ADD COLUMN `detail_page` varchar(255) NULL COMMENT '商品网站详情页' AFTER `category_id`,
ADD COLUMN `created_by` INT(255) NULL DEFAULT NULL COMMENT '创建人' AFTER `detail_page`,
ADD COLUMN `created_time` DATETIME NULL DEFAULT NULL AFTER `created_by`,
ADD COLUMN `updated_by` INT(255) NULL DEFAULT NULL COMMENT '更新人' AFTER `created_time`,
ADD COLUMN `updated_time` DATETIME NULL DEFAULT NULL AFTER `updated_by`,
ADD COLUMN `del_flag` TINYINT(1) NULL DEFAULT 1 AFTER `updated_time`;

ALTER TABLE `tiramisu`.`buss_product_sku` 
DROP INDEX `IDX_PRODUCT_SIZE_WEBSITE`,
DROP COLUMN `is_local_site`,
DROP COLUMN `is_delivery`,
CHANGE COLUMN `del_flag` `del_flag` TINYINT(1) NULL DEFAULT 1,
ADD COLUMN `original_price` INT(8) NULL DEFAULT '0' COMMENT '产品原价（单位：分）' AFTER `price`,
ADD COLUMN `book_time` DOUBLE NOT NULL DEFAULT '0' COMMENT '第一预约时间' AFTER `original_price`,
ADD COLUMN `presell_start` DATETIME NULL DEFAULT NULL COMMENT '预售上架开始时间' AFTER `book_time`,
ADD COLUMN `presell_end` DATETIME NULL DEFAULT NULL COMMENT '预售上架结束时间' AFTER `presell_start`,
ADD COLUMN `send_start` DATETIME NULL DEFAULT NULL COMMENT '预售发货开始时间' AFTER `presell_end`,
ADD COLUMN `send_end` DATETIME NULL DEFAULT NULL COMMENT '预售发货结束时间' AFTER `send_start`,
ADD COLUMN `activity_price` INT(8) NULL DEFAULT NULL COMMENT '活动价格' AFTER `send_end`,
ADD COLUMN `activity_start` DATETIME NULL DEFAULT NULL COMMENT '活动开始时间' AFTER `activity_price`,
ADD COLUMN `activity_end` DATETIME NULL DEFAULT NULL COMMENT '活动结束时间' AFTER `activity_start`;

DROP TABLE IF EXISTS `buss_product_sku_booktime`;
CREATE TABLE `buss_product_sku_booktime` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sku_id` int(10) NOT NULL COMMENT 'skuid',
  `book_time` DOUBLE NOT NULL COMMENT '预约时间',
  `regionalism_id` int(10) NOT NULL COMMENT '区域id',
  `created_by` INT(255) NULL DEFAULT NULL COMMENT '创建人',
  `created_time` DATETIME NULL DEFAULT NULL,
	`updated_by` INT(255) NULL DEFAULT NULL COMMENT '更新人',
	`updated_time` DATETIME NULL DEFAULT NULL,
	`del_flag` TINYINT(1) NULL DEFAULT 1,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='sku第二预约时间';

DROP TABLE IF EXISTS `buss_product_pic`;
CREATE TABLE `buss_product_pic` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `product_id` int(10) DEFAULT NULL COMMENT '产品id',
  `pic_url` varchar(255) DEFAULT NULL COMMENT '图片url',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='产品图片';

# 2016-05-20 Wei Zhao
# 增加退款金额字段
ALTER TABLE `tiramisu`.`buss_order` ADD COLUMN `refund_amount` int(10) unsigned DEFAULT NULL COMMENT '退款金额';

# 每个城市添加未知区
BEGIN;
insert into `dict_regionalism` VALUES
('110199','未知区',110100,'未知','3','','','中国,北京,北京市,未知区','','','Weizhi','1',null,null),
('120199','未知区',120100,'未知','3','','','中国,天津,天津市,未知区','','','Weizhi','1',null,null),
('130199','未知区',130100,'未知','3','','','中国,河北省,石家庄市,未知区','','','Weizhi','1',null,null),
('130299','未知区',130200,'未知','3','','','中国,河北省,唐山市,未知区','','','Weizhi','1',null,null),
('130399','未知区',130300,'未知','3','','','中国,河北省,秦皇岛市,未知区','','','Weizhi','1',null,null),
('130499','未知区',130400,'未知','3','','','中国,河北省,邯郸市,未知区','','','Weizhi','1',null,null),
('130599','未知区',130500,'未知','3','','','中国,河北省,邢台市,未知区','','','Weizhi','1',null,null),
('130699','未知区',130600,'未知','3','','','中国,河北省,保定市,未知区','','','Weizhi','1',null,null),
('130799','未知区',130700,'未知','3','','','中国,河北省,张家口市,未知区','','','Weizhi','1',null,null),
('130899','未知区',130800,'未知','3','','','中国,河北省,承德市,未知区','','','Weizhi','1',null,null),
('130999','未知区',130900,'未知','3','','','中国,河北省,沧州市,未知区','','','Weizhi','1',null,null),
('131099','未知区',131000,'未知','3','','','中国,河北省,廊坊市,未知区','','','Weizhi','1',null,null),
('131199','未知区',131100,'未知','3','','','中国,河北省,衡水市,未知区','','','Weizhi','1',null,null),
('140199','未知区',140100,'未知','3','','','中国,山西省,太原市,未知区','','','Weizhi','1',null,null),
('140299','未知区',140200,'未知','3','','','中国,山西省,大同市,未知区','','','Weizhi','1',null,null),
('140399','未知区',140300,'未知','3','','','中国,山西省,阳泉市,未知区','','','Weizhi','1',null,null),
('140499','未知区',140400,'未知','3','','','中国,山西省,长治市,未知区','','','Weizhi','1',null,null),
('140599','未知区',140500,'未知','3','','','中国,山西省,晋城市,未知区','','','Weizhi','1',null,null),
('140699','未知区',140600,'未知','3','','','中国,山西省,朔州市,未知区','','','Weizhi','1',null,null),
('140799','未知区',140700,'未知','3','','','中国,山西省,晋中市,未知区','','','Weizhi','1',null,null),
('140899','未知区',140800,'未知','3','','','中国,山西省,运城市,未知区','','','Weizhi','1',null,null),
('140999','未知区',140900,'未知','3','','','中国,山西省,忻州市,未知区','','','Weizhi','1',null,null),
('141099','未知区',141000,'未知','3','','','中国,山西省,临汾市,未知区','','','Weizhi','1',null,null),
('141199','未知区',141100,'未知','3','','','中国,山西省,吕梁市,未知区','','','Weizhi','1',null,null),
('150199','未知区',150100,'未知','3','','','中国,内蒙古自治区,呼和浩特市,未知区','','','Weizhi','1',null,null),
('150299','未知区',150200,'未知','3','','','中国,内蒙古自治区,包头市,未知区','','','Weizhi','1',null,null),
('150399','未知区',150300,'未知','3','','','中国,内蒙古自治区,乌海市,未知区','','','Weizhi','1',null,null),
('150499','未知区',150400,'未知','3','','','中国,内蒙古自治区,赤峰市,未知区','','','Weizhi','1',null,null),
('150599','未知区',150500,'未知','3','','','中国,内蒙古自治区,通辽市,未知区','','','Weizhi','1',null,null),
('150699','未知区',150600,'未知','3','','','中国,内蒙古自治区,鄂尔多斯市,未知区','','','Weizhi','1',null,null),
('150799','未知区',150700,'未知','3','','','中国,内蒙古自治区,呼伦贝尔市,未知区','','','Weizhi','1',null,null),
('150899','未知区',150800,'未知','3','','','中国,内蒙古自治区,巴彦淖尔市,未知区','','','Weizhi','1',null,null),
('150999','未知区',150900,'未知','3','','','中国,内蒙古自治区,乌兰察布市,未知区','','','Weizhi','1',null,null),
('152299','未知区',152200,'未知','3','','','中国,内蒙古自治区,兴安盟,未知区','','','Weizhi','1',null,null),
('152599','未知区',152500,'未知','3','','','中国,内蒙古自治区,锡林郭勒盟,未知区','','','Weizhi','1',null,null),
('152999','未知区',152900,'未知','3','','','中国,内蒙古自治区,阿拉善盟,未知区','','','Weizhi','1',null,null),
('210199','未知区',210100,'未知','3','','','中国,辽宁省,沈阳市,未知区','','','Weizhi','1',null,null),
('210299','未知区',210200,'未知','3','','','中国,辽宁省,大连市,未知区','','','Weizhi','1',null,null),
('210399','未知区',210300,'未知','3','','','中国,辽宁省,鞍山市,未知区','','','Weizhi','1',null,null),
('210499','未知区',210400,'未知','3','','','中国,辽宁省,抚顺市,未知区','','','Weizhi','1',null,null),
('210599','未知区',210500,'未知','3','','','中国,辽宁省,本溪市,未知区','','','Weizhi','1',null,null),
('210699','未知区',210600,'未知','3','','','中国,辽宁省,丹东市,未知区','','','Weizhi','1',null,null),
('210799','未知区',210700,'未知','3','','','中国,辽宁省,锦州市,未知区','','','Weizhi','1',null,null),
('210899','未知区',210800,'未知','3','','','中国,辽宁省,营口市,未知区','','','Weizhi','1',null,null),
('210999','未知区',210900,'未知','3','','','中国,辽宁省,阜新市,未知区','','','Weizhi','1',null,null),
('211099','未知区',211000,'未知','3','','','中国,辽宁省,辽阳市,未知区','','','Weizhi','1',null,null),
('211199','未知区',211100,'未知','3','','','中国,辽宁省,盘锦市,未知区','','','Weizhi','1',null,null),
('211299','未知区',211200,'未知','3','','','中国,辽宁省,铁岭市,未知区','','','Weizhi','1',null,null),
('211399','未知区',211300,'未知','3','','','中国,辽宁省,朝阳市,未知区','','','Weizhi','1',null,null),
('211499','未知区',211400,'未知','3','','','中国,辽宁省,葫芦岛市,未知区','','','Weizhi','1',null,null),
('211599','未知区',211500,'未知','3','','','中国,辽宁省,金普新区,未知区','','','Weizhi','1',null,null),
('220199','未知区',220100,'未知','3','','','中国,吉林省,长春市,未知区','','','Weizhi','1',null,null),
('220299','未知区',220200,'未知','3','','','中国,吉林省,吉林市,未知区','','','Weizhi','1',null,null),
('220399','未知区',220300,'未知','3','','','中国,吉林省,四平市,未知区','','','Weizhi','1',null,null),
('220499','未知区',220400,'未知','3','','','中国,吉林省,辽源市,未知区','','','Weizhi','1',null,null),
('220599','未知区',220500,'未知','3','','','中国,吉林省,通化市,未知区','','','Weizhi','1',null,null),
('220699','未知区',220600,'未知','3','','','中国,吉林省,白山市,未知区','','','Weizhi','1',null,null),
('220799','未知区',220700,'未知','3','','','中国,吉林省,松原市,未知区','','','Weizhi','1',null,null),
('220899','未知区',220800,'未知','3','','','中国,吉林省,白城市,未知区','','','Weizhi','1',null,null),
('222499','未知区',222400,'未知','3','','','中国,吉林省,延边朝鲜族自治州,未知区','','','Weizhi','1',null,null),
('230199','未知区',230100,'未知','3','','','中国,黑龙江省,哈尔滨市,未知区','','','Weizhi','1',null,null),
('230299','未知区',230200,'未知','3','','','中国,黑龙江省,齐齐哈尔市,未知区','','','Weizhi','1',null,null),
('230399','未知区',230300,'未知','3','','','中国,黑龙江省,鸡西市,未知区','','','Weizhi','1',null,null),
('230499','未知区',230400,'未知','3','','','中国,黑龙江省,鹤岗市,未知区','','','Weizhi','1',null,null),
('230599','未知区',230500,'未知','3','','','中国,黑龙江省,双鸭山市,未知区','','','Weizhi','1',null,null),
('230699','未知区',230600,'未知','3','','','中国,黑龙江省,大庆市,未知区','','','Weizhi','1',null,null),
('230799','未知区',230700,'未知','3','','','中国,黑龙江省,伊春市,未知区','','','Weizhi','1',null,null),
('230899','未知区',230800,'未知','3','','','中国,黑龙江省,佳木斯市,未知区','','','Weizhi','1',null,null),
('230999','未知区',230900,'未知','3','','','中国,黑龙江省,七台河市,未知区','','','Weizhi','1',null,null),
('231099','未知区',231000,'未知','3','','','中国,黑龙江省,牡丹江市,未知区','','','Weizhi','1',null,null),
('231199','未知区',231100,'未知','3','','','中国,黑龙江省,黑河市,未知区','','','Weizhi','1',null,null),
('231299','未知区',231200,'未知','3','','','中国,黑龙江省,绥化市,未知区','','','Weizhi','1',null,null),
('232799','未知区',232700,'未知','3','','','中国,黑龙江省,大兴安岭地区,未知区','','','Weizhi','1',null,null),
('310199','未知区',310100,'未知','3','','','中国,上海,上海市,未知区','','','Weizhi','1',null,null),
('320199','未知区',320100,'未知','3','','','中国,江苏省,南京市,未知区','','','Weizhi','1',null,null),
('320299','未知区',320200,'未知','3','','','中国,江苏省,无锡市,未知区','','','Weizhi','1',null,null),
('320399','未知区',320300,'未知','3','','','中国,江苏省,徐州市,未知区','','','Weizhi','1',null,null),
('320499','未知区',320400,'未知','3','','','中国,江苏省,常州市,未知区','','','Weizhi','1',null,null),
('320599','未知区',320500,'未知','3','','','中国,江苏省,苏州市,未知区','','','Weizhi','1',null,null),
('320699','未知区',320600,'未知','3','','','中国,江苏省,南通市,未知区','','','Weizhi','1',null,null),
('320799','未知区',320700,'未知','3','','','中国,江苏省,连云港市,未知区','','','Weizhi','1',null,null),
('320899','未知区',320800,'未知','3','','','中国,江苏省,淮安市,未知区','','','Weizhi','1',null,null),
('320999','未知区',320900,'未知','3','','','中国,江苏省,盐城市,未知区','','','Weizhi','1',null,null),
('321099','未知区',321000,'未知','3','','','中国,江苏省,扬州市,未知区','','','Weizhi','1',null,null),
('321199','未知区',321100,'未知','3','','','中国,江苏省,镇江市,未知区','','','Weizhi','1',null,null),
('321299','未知区',321200,'未知','3','','','中国,江苏省,泰州市,未知区','','','Weizhi','1',null,null),
('321399','未知区',321300,'未知','3','','','中国,江苏省,宿迁市,未知区','','','Weizhi','1',null,null),
('330199','未知区',330100,'未知','3','','','中国,浙江省,杭州市,未知区','','','Weizhi','1',null,null),
('330299','未知区',330200,'未知','3','','','中国,浙江省,宁波市,未知区','','','Weizhi','1',null,null),
('330399','未知区',330300,'未知','3','','','中国,浙江省,温州市,未知区','','','Weizhi','1',null,null),
('330499','未知区',330400,'未知','3','','','中国,浙江省,嘉兴市,未知区','','','Weizhi','1',null,null),
('330599','未知区',330500,'未知','3','','','中国,浙江省,湖州市,未知区','','','Weizhi','1',null,null),
('330699','未知区',330600,'未知','3','','','中国,浙江省,绍兴市,未知区','','','Weizhi','1',null,null),
('330799','未知区',330700,'未知','3','','','中国,浙江省,金华市,未知区','','','Weizhi','1',null,null),
('330899','未知区',330800,'未知','3','','','中国,浙江省,衢州市,未知区','','','Weizhi','1',null,null),
('330999','未知区',330900,'未知','3','','','中国,浙江省,舟山市,未知区','','','Weizhi','1',null,null),
('331099','未知区',331000,'未知','3','','','中国,浙江省,台州市,未知区','','','Weizhi','1',null,null),
('331199','未知区',331100,'未知','3','','','中国,浙江省,丽水市,未知区','','','Weizhi','1',null,null),
('331299','未知区',331200,'未知','3','','','中国,浙江省,舟山群岛新区,未知区','','','Weizhi','1',null,null),
('340199','未知区',340100,'未知','3','','','中国,安徽省,合肥市,未知区','','','Weizhi','1',null,null),
('340299','未知区',340200,'未知','3','','','中国,安徽省,芜湖市,未知区','','','Weizhi','1',null,null),
('340399','未知区',340300,'未知','3','','','中国,安徽省,蚌埠市,未知区','','','Weizhi','1',null,null),
('340499','未知区',340400,'未知','3','','','中国,安徽省,淮南市,未知区','','','Weizhi','1',null,null),
('340599','未知区',340500,'未知','3','','','中国,安徽省,马鞍山市,未知区','','','Weizhi','1',null,null),
('340699','未知区',340600,'未知','3','','','中国,安徽省,淮北市,未知区','','','Weizhi','1',null,null),
('340799','未知区',340700,'未知','3','','','中国,安徽省,铜陵市,未知区','','','Weizhi','1',null,null),
('340899','未知区',340800,'未知','3','','','中国,安徽省,安庆市,未知区','','','Weizhi','1',null,null),
('341099','未知区',341000,'未知','3','','','中国,安徽省,黄山市,未知区','','','Weizhi','1',null,null),
('341199','未知区',341100,'未知','3','','','中国,安徽省,滁州市,未知区','','','Weizhi','1',null,null),
('341299','未知区',341200,'未知','3','','','中国,安徽省,阜阳市,未知区','','','Weizhi','1',null,null),
('341399','未知区',341300,'未知','3','','','中国,安徽省,宿州市,未知区','','','Weizhi','1',null,null),
('341599','未知区',341500,'未知','3','','','中国,安徽省,六安市,未知区','','','Weizhi','1',null,null),
('341699','未知区',341600,'未知','3','','','中国,安徽省,亳州市,未知区','','','Weizhi','1',null,null),
('341799','未知区',341700,'未知','3','','','中国,安徽省,池州市,未知区','','','Weizhi','1',null,null),
('341899','未知区',341800,'未知','3','','','中国,安徽省,宣城市,未知区','','','Weizhi','1',null,null),
('350199','未知区',350100,'未知','3','','','中国,福建省,福州市,未知区','','','Weizhi','1',null,null),
('350299','未知区',350200,'未知','3','','','中国,福建省,厦门市,未知区','','','Weizhi','1',null,null),
('350399','未知区',350300,'未知','3','','','中国,福建省,莆田市,未知区','','','Weizhi','1',null,null),
('350499','未知区',350400,'未知','3','','','中国,福建省,三明市,未知区','','','Weizhi','1',null,null),
('350599','未知区',350500,'未知','3','','','中国,福建省,泉州市,未知区','','','Weizhi','1',null,null),
('350699','未知区',350600,'未知','3','','','中国,福建省,漳州市,未知区','','','Weizhi','1',null,null),
('350799','未知区',350700,'未知','3','','','中国,福建省,南平市,未知区','','','Weizhi','1',null,null),
('350899','未知区',350800,'未知','3','','','中国,福建省,龙岩市,未知区','','','Weizhi','1',null,null),
('350999','未知区',350900,'未知','3','','','中国,福建省,宁德市,未知区','','','Weizhi','1',null,null),
('360199','未知区',360100,'未知','3','','','中国,江西省,南昌市,未知区','','','Weizhi','1',null,null),
('360299','未知区',360200,'未知','3','','','中国,江西省,景德镇市,未知区','','','Weizhi','1',null,null),
('360399','未知区',360300,'未知','3','','','中国,江西省,萍乡市,未知区','','','Weizhi','1',null,null),
('360499','未知区',360400,'未知','3','','','中国,江西省,九江市,未知区','','','Weizhi','1',null,null),
('360599','未知区',360500,'未知','3','','','中国,江西省,新余市,未知区','','','Weizhi','1',null,null),
('360699','未知区',360600,'未知','3','','','中国,江西省,鹰潭市,未知区','','','Weizhi','1',null,null),
('360799','未知区',360700,'未知','3','','','中国,江西省,赣州市,未知区','','','Weizhi','1',null,null),
('360899','未知区',360800,'未知','3','','','中国,江西省,吉安市,未知区','','','Weizhi','1',null,null),
('360999','未知区',360900,'未知','3','','','中国,江西省,宜春市,未知区','','','Weizhi','1',null,null),
('361099','未知区',361000,'未知','3','','','中国,江西省,抚州市,未知区','','','Weizhi','1',null,null),
('361199','未知区',361100,'未知','3','','','中国,江西省,上饶市,未知区','','','Weizhi','1',null,null),
('370199','未知区',370100,'未知','3','','','中国,山东省,济南市,未知区','','','Weizhi','1',null,null),
('370299','未知区',370200,'未知','3','','','中国,山东省,青岛市,未知区','','','Weizhi','1',null,null),
('370399','未知区',370300,'未知','3','','','中国,山东省,淄博市,未知区','','','Weizhi','1',null,null),
('370499','未知区',370400,'未知','3','','','中国,山东省,枣庄市,未知区','','','Weizhi','1',null,null),
('370599','未知区',370500,'未知','3','','','中国,山东省,东营市,未知区','','','Weizhi','1',null,null),
('370699','未知区',370600,'未知','3','','','中国,山东省,烟台市,未知区','','','Weizhi','1',null,null),
('370799','未知区',370700,'未知','3','','','中国,山东省,潍坊市,未知区','','','Weizhi','1',null,null),
('370899','未知区',370800,'未知','3','','','中国,山东省,济宁市,未知区','','','Weizhi','1',null,null),
('370999','未知区',370900,'未知','3','','','中国,山东省,泰安市,未知区','','','Weizhi','1',null,null),
('371099','未知区',371000,'未知','3','','','中国,山东省,威海市,未知区','','','Weizhi','1',null,null),
('371199','未知区',371100,'未知','3','','','中国,山东省,日照市,未知区','','','Weizhi','1',null,null),
('371299','未知区',371200,'未知','3','','','中国,山东省,莱芜市,未知区','','','Weizhi','1',null,null),
('371399','未知区',371300,'未知','3','','','中国,山东省,临沂市,未知区','','','Weizhi','1',null,null),
('371499','未知区',371400,'未知','3','','','中国,山东省,德州市,未知区','','','Weizhi','1',null,null),
('371599','未知区',371500,'未知','3','','','中国,山东省,聊城市,未知区','','','Weizhi','1',null,null),
('371699','未知区',371600,'未知','3','','','中国,山东省,滨州市,未知区','','','Weizhi','1',null,null),
('371799','未知区',371700,'未知','3','','','中国,山东省,菏泽市,未知区','','','Weizhi','1',null,null),
('410199','未知区',410100,'未知','3','','','中国,河南省,郑州市,未知区','','','Weizhi','1',null,null),
('410299','未知区',410200,'未知','3','','','中国,河南省,开封市,未知区','','','Weizhi','1',null,null),
('410399','未知区',410300,'未知','3','','','中国,河南省,洛阳市,未知区','','','Weizhi','1',null,null),
('410499','未知区',410400,'未知','3','','','中国,河南省,平顶山市,未知区','','','Weizhi','1',null,null),
('410599','未知区',410500,'未知','3','','','中国,河南省,安阳市,未知区','','','Weizhi','1',null,null),
('410699','未知区',410600,'未知','3','','','中国,河南省,鹤壁市,未知区','','','Weizhi','1',null,null),
('410799','未知区',410700,'未知','3','','','中国,河南省,新乡市,未知区','','','Weizhi','1',null,null),
('410899','未知区',410800,'未知','3','','','中国,河南省,焦作市,未知区','','','Weizhi','1',null,null),
('410999','未知区',410900,'未知','3','','','中国,河南省,濮阳市,未知区','','','Weizhi','1',null,null),
('411099','未知区',411000,'未知','3','','','中国,河南省,许昌市,未知区','','','Weizhi','1',null,null),
('411199','未知区',411100,'未知','3','','','中国,河南省,漯河市,未知区','','','Weizhi','1',null,null),
('411299','未知区',411200,'未知','3','','','中国,河南省,三门峡市,未知区','','','Weizhi','1',null,null),
('411399','未知区',411300,'未知','3','','','中国,河南省,南阳市,未知区','','','Weizhi','1',null,null),
('411499','未知区',411400,'未知','3','','','中国,河南省,商丘市,未知区','','','Weizhi','1',null,null),
('411599','未知区',411500,'未知','3','','','中国,河南省,信阳市,未知区','','','Weizhi','1',null,null),
('411699','未知区',411600,'未知','3','','','中国,河南省,周口市,未知区','','','Weizhi','1',null,null),
('411799','未知区',411700,'未知','3','','','中国,河南省,驻马店市,未知区','','','Weizhi','1',null,null),
('419099','未知区',419000,'未知','3','','','中国,河南省,直辖县级,未知区','','','Weizhi','1',null,null),
('420199','未知区',420100,'未知','3','','','中国,湖北省,武汉市,未知区','','','Weizhi','1',null,null),
('420299','未知区',420200,'未知','3','','','中国,湖北省,黄石市,未知区','','','Weizhi','1',null,null),
('420399','未知区',420300,'未知','3','','','中国,湖北省,十堰市,未知区','','','Weizhi','1',null,null),
('420599','未知区',420500,'未知','3','','','中国,湖北省,宜昌市,未知区','','','Weizhi','1',null,null),
('420699','未知区',420600,'未知','3','','','中国,湖北省,襄阳市,未知区','','','Weizhi','1',null,null),
('420799','未知区',420700,'未知','3','','','中国,湖北省,鄂州市,未知区','','','Weizhi','1',null,null),
('420899','未知区',420800,'未知','3','','','中国,湖北省,荆门市,未知区','','','Weizhi','1',null,null),
('420999','未知区',420900,'未知','3','','','中国,湖北省,孝感市,未知区','','','Weizhi','1',null,null),
('421099','未知区',421000,'未知','3','','','中国,湖北省,荆州市,未知区','','','Weizhi','1',null,null),
('421199','未知区',421100,'未知','3','','','中国,湖北省,黄冈市,未知区','','','Weizhi','1',null,null),
('421299','未知区',421200,'未知','3','','','中国,湖北省,咸宁市,未知区','','','Weizhi','1',null,null),
('421399','未知区',421300,'未知','3','','','中国,湖北省,随州市,未知区','','','Weizhi','1',null,null),
('422899','未知区',422800,'未知','3','','','中国,湖北省,恩施土家族苗族自治州,未知区','','','Weizhi','1',null,null),
('429099','未知区',429000,'未知','3','','','中国,湖北省,直辖县级,未知区','','','Weizhi','1',null,null),
('430199','未知区',430100,'未知','3','','','中国,湖南省,长沙市,未知区','','','Weizhi','1',null,null),
('430299','未知区',430200,'未知','3','','','中国,湖南省,株洲市,未知区','','','Weizhi','1',null,null),
('430399','未知区',430300,'未知','3','','','中国,湖南省,湘潭市,未知区','','','Weizhi','1',null,null),
('430499','未知区',430400,'未知','3','','','中国,湖南省,衡阳市,未知区','','','Weizhi','1',null,null),
('430599','未知区',430500,'未知','3','','','中国,湖南省,邵阳市,未知区','','','Weizhi','1',null,null),
('430699','未知区',430600,'未知','3','','','中国,湖南省,岳阳市,未知区','','','Weizhi','1',null,null),
('430799','未知区',430700,'未知','3','','','中国,湖南省,常德市,未知区','','','Weizhi','1',null,null),
('430899','未知区',430800,'未知','3','','','中国,湖南省,张家界市,未知区','','','Weizhi','1',null,null),
('430999','未知区',430900,'未知','3','','','中国,湖南省,益阳市,未知区','','','Weizhi','1',null,null),
('431099','未知区',431000,'未知','3','','','中国,湖南省,郴州市,未知区','','','Weizhi','1',null,null),
('431199','未知区',431100,'未知','3','','','中国,湖南省,永州市,未知区','','','Weizhi','1',null,null),
('431299','未知区',431200,'未知','3','','','中国,湖南省,怀化市,未知区','','','Weizhi','1',null,null),
('431399','未知区',431300,'未知','3','','','中国,湖南省,娄底市,未知区','','','Weizhi','1',null,null),
('433199','未知区',433100,'未知','3','','','中国,湖南省,湘西土家族苗族自治州,未知区','','','Weizhi','1',null,null),
('440199','未知区',440100,'未知','3','','','中国,广东省,广州市,未知区','','','Weizhi','1',null,null),
('440299','未知区',440200,'未知','3','','','中国,广东省,韶关市,未知区','','','Weizhi','1',null,null),
('440399','未知区',440300,'未知','3','','','中国,广东省,深圳市,未知区','','','Weizhi','1',null,null),
('440499','未知区',440400,'未知','3','','','中国,广东省,珠海市,未知区','','','Weizhi','1',null,null),
('440599','未知区',440500,'未知','3','','','中国,广东省,汕头市,未知区','','','Weizhi','1',null,null),
('440699','未知区',440600,'未知','3','','','中国,广东省,佛山市,未知区','','','Weizhi','1',null,null),
('440799','未知区',440700,'未知','3','','','中国,广东省,江门市,未知区','','','Weizhi','1',null,null),
('440899','未知区',440800,'未知','3','','','中国,广东省,湛江市,未知区','','','Weizhi','1',null,null),
('440999','未知区',440900,'未知','3','','','中国,广东省,茂名市,未知区','','','Weizhi','1',null,null),
('441299','未知区',441200,'未知','3','','','中国,广东省,肇庆市,未知区','','','Weizhi','1',null,null),
('441399','未知区',441300,'未知','3','','','中国,广东省,惠州市,未知区','','','Weizhi','1',null,null),
('441499','未知区',441400,'未知','3','','','中国,广东省,梅州市,未知区','','','Weizhi','1',null,null),
('441599','未知区',441500,'未知','3','','','中国,广东省,汕尾市,未知区','','','Weizhi','1',null,null),
('441699','未知区',441600,'未知','3','','','中国,广东省,河源市,未知区','','','Weizhi','1',null,null),
('441799','未知区',441700,'未知','3','','','中国,广东省,阳江市,未知区','','','Weizhi','1',null,null),
('441899','未知区',441800,'未知','3','','','中国,广东省,清远市,未知区','','','Weizhi','1',null,null),
('441999','未知区',441900,'未知','3','','','中国,广东省,东莞市,未知区','','','Weizhi','1',null,null),
('442099','未知区',442000,'未知','3','','','中国,广东省,中山市,未知区','','','Weizhi','1',null,null),
('445199','未知区',445100,'未知','3','','','中国,广东省,潮州市,未知区','','','Weizhi','1',null,null),
('445299','未知区',445200,'未知','3','','','中国,广东省,揭阳市,未知区','','','Weizhi','1',null,null),
('445399','未知区',445300,'未知','3','','','中国,广东省,云浮市,未知区','','','Weizhi','1',null,null),
('450199','未知区',450100,'未知','3','','','中国,广西壮族自治区,南宁市,未知区','','','Weizhi','1',null,null),
('450299','未知区',450200,'未知','3','','','中国,广西壮族自治区,柳州市,未知区','','','Weizhi','1',null,null),
('450399','未知区',450300,'未知','3','','','中国,广西壮族自治区,桂林市,未知区','','','Weizhi','1',null,null),
('450499','未知区',450400,'未知','3','','','中国,广西壮族自治区,梧州市,未知区','','','Weizhi','1',null,null),
('450599','未知区',450500,'未知','3','','','中国,广西壮族自治区,北海市,未知区','','','Weizhi','1',null,null),
('450699','未知区',450600,'未知','3','','','中国,广西壮族自治区,防城港市,未知区','','','Weizhi','1',null,null),
('450799','未知区',450700,'未知','3','','','中国,广西壮族自治区,钦州市,未知区','','','Weizhi','1',null,null),
('450899','未知区',450800,'未知','3','','','中国,广西壮族自治区,贵港市,未知区','','','Weizhi','1',null,null),
('450999','未知区',450900,'未知','3','','','中国,广西壮族自治区,玉林市,未知区','','','Weizhi','1',null,null),
('451099','未知区',451000,'未知','3','','','中国,广西壮族自治区,百色市,未知区','','','Weizhi','1',null,null),
('451199','未知区',451100,'未知','3','','','中国,广西壮族自治区,贺州市,未知区','','','Weizhi','1',null,null),
('451299','未知区',451200,'未知','3','','','中国,广西壮族自治区,河池市,未知区','','','Weizhi','1',null,null),
('451399','未知区',451300,'未知','3','','','中国,广西壮族自治区,来宾市,未知区','','','Weizhi','1',null,null),
('451499','未知区',451400,'未知','3','','','中国,广西壮族自治区,崇左市,未知区','','','Weizhi','1',null,null),
('460199','未知区',460100,'未知','3','','','中国,海南省,海口市,未知区','','','Weizhi','1',null,null),
('460299','未知区',460200,'未知','3','','','中国,海南省,三亚市,未知区','','','Weizhi','1',null,null),
('460399','未知区',460300,'未知','3','','','中国,海南省,三沙市,未知区','','','Weizhi','1',null,null),
('469099','未知区',469000,'未知','3','','','中国,海南省,直辖县级,未知区','','','Weizhi','1',null,null),
('500199','未知区',500100,'未知','3','','','中国,重庆,重庆市,未知区','','','Weizhi','1',null,null),
('500399','未知区',500300,'未知','3','','','中国,重庆,两江新区,未知区','','','Weizhi','1',null,null),
('510199','未知区',510100,'未知','3','','','中国,四川省,成都市,未知区','','','Weizhi','1',null,null),
('510399','未知区',510300,'未知','3','','','中国,四川省,自贡市,未知区','','','Weizhi','1',null,null),
('510499','未知区',510400,'未知','3','','','中国,四川省,攀枝花市,未知区','','','Weizhi','1',null,null),
('510599','未知区',510500,'未知','3','','','中国,四川省,泸州市,未知区','','','Weizhi','1',null,null),
('510699','未知区',510600,'未知','3','','','中国,四川省,德阳市,未知区','','','Weizhi','1',null,null),
('510799','未知区',510700,'未知','3','','','中国,四川省,绵阳市,未知区','','','Weizhi','1',null,null),
('510899','未知区',510800,'未知','3','','','中国,四川省,广元市,未知区','','','Weizhi','1',null,null),
('510999','未知区',510900,'未知','3','','','中国,四川省,遂宁市,未知区','','','Weizhi','1',null,null),
('511099','未知区',511000,'未知','3','','','中国,四川省,内江市,未知区','','','Weizhi','1',null,null),
('511199','未知区',511100,'未知','3','','','中国,四川省,乐山市,未知区','','','Weizhi','1',null,null),
('511399','未知区',511300,'未知','3','','','中国,四川省,南充市,未知区','','','Weizhi','1',null,null),
('511499','未知区',511400,'未知','3','','','中国,四川省,眉山市,未知区','','','Weizhi','1',null,null),
('511599','未知区',511500,'未知','3','','','中国,四川省,宜宾市,未知区','','','Weizhi','1',null,null),
('511699','未知区',511600,'未知','3','','','中国,四川省,广安市,未知区','','','Weizhi','1',null,null),
('511799','未知区',511700,'未知','3','','','中国,四川省,达州市,未知区','','','Weizhi','1',null,null),
('511899','未知区',511800,'未知','3','','','中国,四川省,雅安市,未知区','','','Weizhi','1',null,null),
('511999','未知区',511900,'未知','3','','','中国,四川省,巴中市,未知区','','','Weizhi','1',null,null),
('512099','未知区',512000,'未知','3','','','中国,四川省,资阳市,未知区','','','Weizhi','1',null,null),
('513299','未知区',513200,'未知','3','','','中国,四川省,阿坝藏族羌族自治州,未知区','','','Weizhi','1',null,null),
('513399','未知区',513300,'未知','3','','','中国,四川省,甘孜藏族自治州,未知区','','','Weizhi','1',null,null),
('513499','未知区',513400,'未知','3','','','中国,四川省,凉山彝族自治州,未知区','','','Weizhi','1',null,null),
('520199','未知区',520100,'未知','3','','','中国,贵州省,贵阳市,未知区','','','Weizhi','1',null,null),
('520299','未知区',520200,'未知','3','','','中国,贵州省,六盘水市,未知区','','','Weizhi','1',null,null),
('520399','未知区',520300,'未知','3','','','中国,贵州省,遵义市,未知区','','','Weizhi','1',null,null),
('520499','未知区',520400,'未知','3','','','中国,贵州省,安顺市,未知区','','','Weizhi','1',null,null),
('520599','未知区',520500,'未知','3','','','中国,贵州省,毕节市,未知区','','','Weizhi','1',null,null),
('520699','未知区',520600,'未知','3','','','中国,贵州省,铜仁市,未知区','','','Weizhi','1',null,null),
('522399','未知区',522300,'未知','3','','','中国,贵州省,黔西南布依族苗族自治州,未知区','','','Weizhi','1',null,null),
('522699','未知区',522600,'未知','3','','','中国,贵州省,黔东南苗族侗族自治州,未知区','','','Weizhi','1',null,null),
('522799','未知区',522700,'未知','3','','','中国,贵州省,黔南布依族苗族自治州,未知区','','','Weizhi','1',null,null),
('530199','未知区',530100,'未知','3','','','中国,云南省,昆明市,未知区','','','Weizhi','1',null,null),
('530399','未知区',530300,'未知','3','','','中国,云南省,曲靖市,未知区','','','Weizhi','1',null,null),
('530499','未知区',530400,'未知','3','','','中国,云南省,玉溪市,未知区','','','Weizhi','1',null,null),
('530599','未知区',530500,'未知','3','','','中国,云南省,保山市,未知区','','','Weizhi','1',null,null),
('530699','未知区',530600,'未知','3','','','中国,云南省,昭通市,未知区','','','Weizhi','1',null,null),
('530799','未知区',530700,'未知','3','','','中国,云南省,丽江市,未知区','','','Weizhi','1',null,null),
('530899','未知区',530800,'未知','3','','','中国,云南省,普洱市,未知区','','','Weizhi','1',null,null),
('530999','未知区',530900,'未知','3','','','中国,云南省,临沧市,未知区','','','Weizhi','1',null,null),
('532399','未知区',532300,'未知','3','','','中国,云南省,楚雄彝族自治州,未知区','','','Weizhi','1',null,null),
('532599','未知区',532500,'未知','3','','','中国,云南省,红河哈尼族彝族自治州,未知区','','','Weizhi','1',null,null),
('532699','未知区',532600,'未知','3','','','中国,云南省,文山壮族苗族自治州,未知区','','','Weizhi','1',null,null),
('532899','未知区',532800,'未知','3','','','中国,云南省,西双版纳傣族自治州,未知区','','','Weizhi','1',null,null),
('532999','未知区',532900,'未知','3','','','中国,云南省,大理白族自治州,未知区','','','Weizhi','1',null,null),
('533199','未知区',533100,'未知','3','','','中国,云南省,德宏傣族景颇族自治州,未知区','','','Weizhi','1',null,null),
('533399','未知区',533300,'未知','3','','','中国,云南省,怒江傈僳族自治州,未知区','','','Weizhi','1',null,null),
('533499','未知区',533400,'未知','3','','','中国,云南省,迪庆藏族自治州,未知区','','','Weizhi','1',null,null),
('540199','未知区',540100,'未知','3','','','中国,西藏自治区,拉萨市,未知区','','','Weizhi','1',null,null),
('540299','未知区',540200,'未知','3','','','中国,西藏自治区,日喀则市,未知区','','','Weizhi','1',null,null),
('540399','未知区',540300,'未知','3','','','中国,西藏自治区,昌都市,未知区','','','Weizhi','1',null,null),
('542299','未知区',542200,'未知','3','','','中国,西藏自治区,山南地区,未知区','','','Weizhi','1',null,null),
('542499','未知区',542400,'未知','3','','','中国,西藏自治区,那曲地区,未知区','','','Weizhi','1',null,null),
('542599','未知区',542500,'未知','3','','','中国,西藏自治区,阿里地区,未知区','','','Weizhi','1',null,null),
('542699','未知区',542600,'未知','3','','','中国,西藏自治区,林芝地区,未知区','','','Weizhi','1',null,null),
('610199','未知区',610100,'未知','3','','','中国,陕西省,西安市,未知区','','','Weizhi','1',null,null),
('610299','未知区',610200,'未知','3','','','中国,陕西省,铜川市,未知区','','','Weizhi','1',null,null),
('610399','未知区',610300,'未知','3','','','中国,陕西省,宝鸡市,未知区','','','Weizhi','1',null,null),
('610499','未知区',610400,'未知','3','','','中国,陕西省,咸阳市,未知区','','','Weizhi','1',null,null),
('610599','未知区',610500,'未知','3','','','中国,陕西省,渭南市,未知区','','','Weizhi','1',null,null),
('610699','未知区',610600,'未知','3','','','中国,陕西省,延安市,未知区','','','Weizhi','1',null,null),
('610799','未知区',610700,'未知','3','','','中国,陕西省,汉中市,未知区','','','Weizhi','1',null,null),
('610899','未知区',610800,'未知','3','','','中国,陕西省,榆林市,未知区','','','Weizhi','1',null,null),
('610999','未知区',610900,'未知','3','','','中国,陕西省,安康市,未知区','','','Weizhi','1',null,null),
('611099','未知区',611000,'未知','3','','','中国,陕西省,商洛市,未知区','','','Weizhi','1',null,null),
('611199','未知区',611100,'未知','3','','','中国,陕西省,西咸新区,未知区','','','Weizhi','1',null,null),
('620199','未知区',620100,'未知','3','','','中国,甘肃省,兰州市,未知区','','','Weizhi','1',null,null),
('620299','未知区',620200,'未知','3','','','中国,甘肃省,嘉峪关市,未知区','','','Weizhi','1',null,null),
('620399','未知区',620300,'未知','3','','','中国,甘肃省,金昌市,未知区','','','Weizhi','1',null,null),
('620499','未知区',620400,'未知','3','','','中国,甘肃省,白银市,未知区','','','Weizhi','1',null,null),
('620599','未知区',620500,'未知','3','','','中国,甘肃省,天水市,未知区','','','Weizhi','1',null,null),
('620699','未知区',620600,'未知','3','','','中国,甘肃省,武威市,未知区','','','Weizhi','1',null,null),
('620799','未知区',620700,'未知','3','','','中国,甘肃省,张掖市,未知区','','','Weizhi','1',null,null),
('620899','未知区',620800,'未知','3','','','中国,甘肃省,平凉市,未知区','','','Weizhi','1',null,null),
('620999','未知区',620900,'未知','3','','','中国,甘肃省,酒泉市,未知区','','','Weizhi','1',null,null),
('621099','未知区',621000,'未知','3','','','中国,甘肃省,庆阳市,未知区','','','Weizhi','1',null,null),
('621199','未知区',621100,'未知','3','','','中国,甘肃省,定西市,未知区','','','Weizhi','1',null,null),
('621299','未知区',621200,'未知','3','','','中国,甘肃省,陇南市,未知区','','','Weizhi','1',null,null),
('622999','未知区',622900,'未知','3','','','中国,甘肃省,临夏回族自治州,未知区','','','Weizhi','1',null,null),
('623099','未知区',623000,'未知','3','','','中国,甘肃省,甘南藏族自治州,未知区','','','Weizhi','1',null,null),
('630199','未知区',630100,'未知','3','','','中国,青海省,西宁市,未知区','','','Weizhi','1',null,null),
('630299','未知区',630200,'未知','3','','','中国,青海省,海东市,未知区','','','Weizhi','1',null,null),
('632299','未知区',632200,'未知','3','','','中国,青海省,海北藏族自治州,未知区','','','Weizhi','1',null,null),
('632399','未知区',632300,'未知','3','','','中国,青海省,黄南藏族自治州,未知区','','','Weizhi','1',null,null),
('632599','未知区',632500,'未知','3','','','中国,青海省,海南藏族自治州,未知区','','','Weizhi','1',null,null),
('632699','未知区',632600,'未知','3','','','中国,青海省,果洛藏族自治州,未知区','','','Weizhi','1',null,null),
('632799','未知区',632700,'未知','3','','','中国,青海省,玉树藏族自治州,未知区','','','Weizhi','1',null,null),
('632899','未知区',632800,'未知','3','','','中国,青海省,海西蒙古族藏族自治州,未知区','','','Weizhi','1',null,null),
('640199','未知区',640100,'未知','3','','','中国,宁夏回族自治区,银川市,未知区','','','Weizhi','1',null,null),
('640299','未知区',640200,'未知','3','','','中国,宁夏回族自治区,石嘴山市,未知区','','','Weizhi','1',null,null),
('640399','未知区',640300,'未知','3','','','中国,宁夏回族自治区,吴忠市,未知区','','','Weizhi','1',null,null),
('640499','未知区',640400,'未知','3','','','中国,宁夏回族自治区,固原市,未知区','','','Weizhi','1',null,null),
('640599','未知区',640500,'未知','3','','','中国,宁夏回族自治区,中卫市,未知区','','','Weizhi','1',null,null),
('650199','未知区',650100,'未知','3','','','中国,新疆维吾尔自治区,乌鲁木齐市,未知区','','','Weizhi','1',null,null),
('650299','未知区',650200,'未知','3','','','中国,新疆维吾尔自治区,克拉玛依市,未知区','','','Weizhi','1',null,null),
('652199','未知区',652100,'未知','3','','','中国,新疆维吾尔自治区,吐鲁番地区,未知区','','','Weizhi','1',null,null),
('652299','未知区',652200,'未知','3','','','中国,新疆维吾尔自治区,哈密地区,未知区','','','Weizhi','1',null,null),
('652399','未知区',652300,'未知','3','','','中国,新疆维吾尔自治区,昌吉回族自治州,未知区','','','Weizhi','1',null,null),
('652799','未知区',652700,'未知','3','','','中国,新疆维吾尔自治区,博尔塔拉蒙古自治州,未知区','','','Weizhi','1',null,null),
('652899','未知区',652800,'未知','3','','','中国,新疆维吾尔自治区,巴音郭楞蒙古自治州,未知区','','','Weizhi','1',null,null),
('652999','未知区',652900,'未知','3','','','中国,新疆维吾尔自治区,阿克苏地区,未知区','','','Weizhi','1',null,null),
('653099','未知区',653000,'未知','3','','','中国,新疆维吾尔自治区,克孜勒苏柯尔克孜自治州,未知区','','','Weizhi','1',null,null),
('653199','未知区',653100,'未知','3','','','中国,新疆维吾尔自治区,喀什地区,未知区','','','Weizhi','1',null,null),
('653299','未知区',653200,'未知','3','','','中国,新疆维吾尔自治区,和田地区,未知区','','','Weizhi','1',null,null),
('654099','未知区',654000,'未知','3','','','中国,新疆维吾尔自治区,伊犁哈萨克自治州,未知区','','','Weizhi','1',null,null),
('654299','未知区',654200,'未知','3','','','中国,新疆维吾尔自治区,塔城地区,未知区','','','Weizhi','1',null,null),
('654399','未知区',654300,'未知','3','','','中国,新疆维吾尔自治区,阿勒泰地区,未知区','','','Weizhi','1',null,null),
('659099','未知区',659000,'未知','3','','','中国,新疆维吾尔自治区,直辖县级,未知区','','','Weizhi','1',null,null),
('710199','未知区',710100,'未知','3','','','中国,台湾,台北市,未知区','','','Weizhi','1',null,null),
('710299','未知区',710200,'未知','3','','','中国,台湾,高雄市,未知区','','','Weizhi','1',null,null),
('710399','未知区',710300,'未知','3','','','中国,台湾,基隆市,未知区','','','Weizhi','1',null,null),
('710499','未知区',710400,'未知','3','','','中国,台湾,台中市,未知区','','','Weizhi','1',null,null),
('710599','未知区',710500,'未知','3','','','中国,台湾,台南市,未知区','','','Weizhi','1',null,null),
('710699','未知区',710600,'未知','3','','','中国,台湾,新竹市,未知区','','','Weizhi','1',null,null),
('710799','未知区',710700,'未知','3','','','中国,台湾,嘉义市,未知区','','','Weizhi','1',null,null),
('710899','未知区',710800,'未知','3','','','中国,台湾,新北市,未知区','','','Weizhi','1',null,null),
('712299','未知区',712200,'未知','3','','','中国,台湾,宜兰县,未知区','','','Weizhi','1',null,null),
('712399','未知区',712300,'未知','3','','','中国,台湾,桃园县,未知区','','','Weizhi','1',null,null),
('712499','未知区',712400,'未知','3','','','中国,台湾,新竹县,未知区','','','Weizhi','1',null,null),
('712599','未知区',712500,'未知','3','','','中国,台湾,苗栗县,未知区','','','Weizhi','1',null,null),
('712799','未知区',712700,'未知','3','','','中国,台湾,彰化县,未知区','','','Weizhi','1',null,null),
('712899','未知区',712800,'未知','3','','','中国,台湾,南投县,未知区','','','Weizhi','1',null,null),
('712999','未知区',712900,'未知','3','','','中国,台湾,云林县,未知区','','','Weizhi','1',null,null),
('713099','未知区',713000,'未知','3','','','中国,台湾,嘉义县,未知区','','','Weizhi','1',null,null),
('713399','未知区',713300,'未知','3','','','中国,台湾,屏东县,未知区','','','Weizhi','1',null,null),
('713499','未知区',713400,'未知','3','','','中国,台湾,台东县,未知区','','','Weizhi','1',null,null),
('713599','未知区',713500,'未知','3','','','中国,台湾,花莲县,未知区','','','Weizhi','1',null,null),
('713699','未知区',713600,'未知','3','','','中国,台湾,澎湖县,未知区','','','Weizhi','1',null,null),
('713799','未知区',713700,'未知','3','','','中国,台湾,金门县,未知区','','','Weizhi','1',null,null),
('713899','未知区',713800,'未知','3','','','中国,台湾,连江县,未知区','','','Weizhi','1',null,null),
('810199','未知区',810100,'未知','3','','','中国,香港特别行政区,香港岛,未知区','','','Weizhi','1',null,null),
('810299','未知区',810200,'未知','3','','','中国,香港特别行政区,九龙,未知区','','','Weizhi','1',null,null),
('810399','未知区',810300,'未知','3','','','中国,香港特别行政区,新界,未知区','','','Weizhi','1',null,null),
('820199','未知区',820100,'未知','3','','','中国,澳门特别行政区,澳门半岛,未知区','','','Weizhi','1',null,null),
('820299','未知区',820200,'未知','3','','','中国,澳门特别行政区,氹仔岛,未知区','','','Weizhi','1',null,null),
('820399','未知区',820300,'未知','3','','','中国,澳门特别行政区,路环岛,未知区','','','Weizhi','1',null,null);
COMMIT;

# 修改连云港市区域信息
BEGIN;
update `dict_regionalism` set name = '赣榆县' where id = '320707';
insert into `dict_regionalism` VALUES
('320725','新浦区',320700,'新浦','3','0518','','中国,江苏省,连云港市,新浦区','','','Xinpu','1',null,null);
COMMIT;

# 修改区域信息to匹配有赞
BEGIN;
insert into `dict_regionalism` VALUES
('442028','古镇',442000,'古镇','3','0760','','中国,广东省,中山市,古镇','','','Guzhen','1',null,null);
insert into `dict_regionalism` VALUES
('442029','沙朗镇',442000,'沙朗','3','0760','','中国,广东省,中山市,沙朗镇','','','ShaLang','1',null,null);
insert into `dict_regionalism` VALUES
('410186','高新技术开发区',410100,'高新技术开发','3','0371','','中国,河南省,郑州市,高新技术开发区','','','Gaoxinjishukaifa','1',null,null);
insert into `dict_regionalism` VALUES
('410187','经济开发区',410100,'经济开发','3','0371','','中国,河南省,郑州市,经济开发区','','','Jingjikaifa','1',null,null);
insert into `dict_regionalism` VALUES
('410188','郑东新区',410100,'郑东新','3','0371','','中国,河南省,郑州市,郑东新区','','','Zhengdongxin','1',null,null);
COMMIT;

# 2016-05-26 Wei Zhao
# 菜单模块增加等级
ALTER TABLE tiramisu.sys_menu ALTER COLUMN parent_id SET DEFAULT 0;
ALTER TABLE tiramisu.sys_menu ALTER COLUMN parent_ids SET DEFAULT '';
ALTER TABLE tiramisu.sys_menu ADD level tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '层级';
UPDATE tiramisu.sys_menu SET parent_id = 0;
UPDATE tiramisu.sys_menu SET parent_ids = '';

# 2016-06-02 Wei Zhao
# 用户权限增加是否仅仅只有管理该用户的权限
ALTER TABLE tiramisu.sys_user_role ADD only_admin tinyint(1) unsigned DEFAULT '0' COMMENT '是否仅仅只有管理该类型用户的权限';

# 修改区域信息to匹配有赞
BEGIN;
insert into `dict_regionalism` VALUES
('440119','萝岗区',440100,'萝岗','3','020','','中国,广东省,广州市,增城区','','','Luogang','1',null,null);
COMMIT;

<<<<<<< HEAD
-- ----------------------------
--  Table structure for `sys_history`
-- ----------------------------
DROP TABLE IF EXISTS `sys_history`;
CREATE TABLE `sys_history` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT 'id',
  `type` int(10) NOT NULL COMMENT '记录类型id',
  `option` varchar(2000) NOT NULL COMMENT '操作记录',
  `remarks` varchar(255) NOT NULL COMMENT '备注',
  `created_by` varchar(255) NOT NULL COMMENT '创建人',
  `created_time` datetime NOT NULL COMMENT '创建时间',
  `del_flag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '软删除标志',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='系统操作记录';

-- ----------------------------
--  Table structure for `sys_history_type`
-- ----------------------------
DROP TABLE IF EXISTS `sys_history_type`;
CREATE TABLE `sys_history_type` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT 'id',
  `name` varchar(255) NOT NULL COMMENT '操作名称',
  `created_by` varchar(255) NOT NULL COMMENT '创建人',
  `created_time` datetime NOT NULL COMMENT '创建时间',
  `del_flag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '软删除标志',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='系统操作记录类型';

INSERT INTO `tiramisu`.`sys_history_type` (`name`, `created_by`, `created_time`) VALUES ('编辑产品', '1', '2016-06-20 12:00:00');

=======
>>>>>>> origin/fix_pemission_trim
# 2016-06-15 Wei Zhao
# 创建开通城市表
DROP TABLE IF EXISTS `sys_city`;
CREATE TABLE `sys_city` (
    `regionalism_id` int(11) NOT NULL COMMENT '区域id',
    `is_city` int(11) DEFAULT '0' COMMENT '不为0时表示是开通的地级市/县级市',
    `online_time` datetime DEFAULT NULL COMMENT '上线时间',
    `is_diversion` tinyint(1) DEFAULT NULL COMMENT '是否导流订单',
    `delivery_time_range` varchar(16) DEFAULT NULL COMMENT '配送时间段',
    `order_time` int(11) DEFAULT NULL COMMENT '预约时间',
    `manager_name` varchar(32) DEFAULT NULL COMMENT '城市经理姓名',
    `manager_mobile` varchar(32) DEFAULT NULL COMMENT '城市经理电话',
    `remarks` varchar(255) DEFAULT NULL COMMENT '备注',
    `SEO` varchar(1024) DEFAULT NULL COMMENT 'SEO',
    `created_by` int(11) NOT NULL COMMENT '创建人id',
    `created_time` datetime NOT NULL COMMENT '创建时间',
    `updated_by` int(11) DEFAULT NULL COMMENT '记录更新操作者id',
    `updated_time` datetime DEFAULT NULL COMMENT '记录更新时间',
    PRIMARY KEY `IDX_UNQ_UID` (`regionalism_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='开通城市表';

# 触发器：删除sku下的二级配送时间
DROP TRIGGER IF EXISTS `cascade_delete_sku_booktime`;
CREATE TRIGGER cascade_delete_sku_booktime after UPDATE ON buss_product_sku
for each row 
begin 
if new.del_flag = 0 
then
UPDATE buss_product_sku_booktime 
SET 
    del_flag = 0
WHERE
    sku_id = new.id;
end if;
end;

# 触发器：删除产品下的sku
# 触发器：修改产品所属分类，则删除产品下不属于二级分类区域的sku
# 后续触发cascade_delete_sku_booktime
DROP TRIGGER IF EXISTS `cascade_delete_sku`;
CREATE TRIGGER cascade_delete_sku after UPDATE ON buss_product
for each row 
begin 
# 触发器：删除产品下的sku
if new.del_flag = 0 
then
UPDATE buss_product_sku 
SET 
    del_flag = 0
WHERE
    product_id = new.id;
end if;
# 触发器：修改产品所属分类，则删除产品下不属于二级分类区域的sku
if new.category_id <> old.category_id
then
    update buss_product_sku
    set del_flag = 0 
    where product_id = old.id and regionalism_id not in (
        select regionalism_id from buss_product_category_regionalism region
        where region.category_id = new.category_id
    );
end if;
end;

# 触发器：删除分类下的产品
# 后续触发cascade_delete_sku、cascade_delete_sku_booktime
DROP TRIGGER IF EXISTS `cascade_delete_category_product_sku`;
CREATE TRIGGER cascade_delete_category_product_sku after UPDATE ON buss_product_category
for each row 
begin 
if new.del_flag = 0
then
update buss_product_category_regionalism set del_flag = 0 where category_id = old.id;
UPDATE buss_product 
SET 
    del_flag = 0
WHERE
    category_id = old.id;
end if;
end;

# 触发器：删除二级分类下的产品关联区域
# 删除一级分类区域，会先删除二级分类区域，因为触发器不能使用递归，所以在代码层面实现删除
DROP TRIGGER IF EXISTS `cascade_delete_product_sku_about_region`;
CREATE TRIGGER cascade_delete_product_sku_about_region after UPDATE ON buss_product_category_regionalism
for each row 
begin 
DECLARE x INT;
if new.del_flag = 0
then
SET x = (select parent_id from buss_product_category where id = old.category_id);
if x <> 0
then 
    # 删除二级分类
    update buss_product_sku 
    set del_flag = 0 
    where product_id in (
        select product.id as id 
        from buss_product_category category join buss_product product 
        on category.id = product.category_id and category.id = old.category_id
    );
end if;
end if;
end;
